---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionSequenceNum
source: html/c3bfbaab-55b8-6738-b4d4-df15215492f1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionSequenceNum Property

"Revision Sequence": read_only Make this read-only again when NewSchedules_DisplayTags is cleaned up

## Syntax (C#)
```csharp
public static ForgeTypeId ProjectRevisionSequenceNum { get; }
```